4dogs_dalvik/doc/D1.org
#+TITLE: Aprotector例会以及任务
#+AUTHOR: 四维创智
#+DATE:13/6/2013

* 进度
** 6.18 - 6.23
	 1.调查dalvik虚拟机的用法，以及命令参数(李晋飞)

	 2.libdex,dumpdex在windows以及ubuntu系统上的移植(阎文斌)

	 3.找到所有dalvik源代码所需的头文件以及源文件并且综合到一起(阎文斌)

	 4.将dalvik的源代码粗略的过一遍，并形成源文件解释文档(阎文斌，王一飞，彭州，王艳东)

	 5.做一个简单的loader程序,此loader是正常的dex文件,加载一个名为chaosvm.so的动态库并打包成apk。打印是否成功。(李晋飞)

	 6.X1的设计（王一飞) <- 23号对此插件进行了探讨

** 6.24 - 6.30
	 1.对X1重新设计的讨论(王一飞)

	 2.每个人对于623代码分析任务的完成时间进行评估(全体项目组)

** 6.30 - 7.16
   1.除阎文斌与彭州外其余人完成对所分析的代码模块

   2.针对hprof进行深入的调查研究(王艳东)

* 任务
** 623任务
	 alloc目录 - 内存管理 356K (王艳东)

	 analysis - dex文件解析 504K (王一飞 李靖飞)

	 arch - 针对平台进行兼容的代码 80K (阎文斌)

	 compiler - 编译技术实现 3.9M (阎文斌 王艳东)

	 hprof - 内存分析模块 60K (王艳东)

	 interp - c语言版本的字节码解释器 224K (彭州)

	 minterp - 通过c语言版本的解释器生成对应平台的汇编解释器 12M (彭州)

	 jdwp - jdwp调试协议 232K 王一飞 (李靖飞)

	 native - JNI方面的原生JAVA接口 304K (王一飞 李靖飞)

	 oo - 面对对象的处理 340K 王一飞 (李靖飞)

	 os - 针对系统的线程方面的封装 20K (王艳东)

	 reflect - java反射实现 164K (王一飞 李靖飞)

** 630任务
   analysis - dex文件解析 504K (王一飞）

   oo - 面对对象的处理 340K (李靖飞)

   reflect - java反射实现 164K (李靖飞)

   native - JNIT方面的原声JAVA接口 304K (王一飞 李靖飞)

   对hprof的实际使用，以及当前android提供的应用做了解(王艳东)

* 例会
	 6.23(13:30 - 16.15) 623代码分析任务的第一次分工,以及文档的规格。下周确定623任务完成时间。

	 6.30(13:40 - ) 首先对飞哥进行了批评，提交文档格式不正确。飞哥对X1的设计延后。
	 针对623任务的时间进行了规划，确定了代码分析的时间，重新划分了王一飞与李靖飞的工作。

     | 姓名   | 时间进度 |
     | 王一飞 | 2周      |
     | 李靖飞 | 2周      |
     | 彭州   | 1月      |
     | 王艳东 | 2周      |
     | 阎文斌 | 1月      |
	 
	 
	 
	 
	 
