4dogs_dalvik/doc/D1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Aprotector例会以及任务</title>
<!-- 2013-06-30 日 23:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="四维创智"/>
</head>
<body>
<div id="content">
<h1 class="title">Aprotector例会以及任务</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 进度</a>
<ul>
<li><a href="#sec-1-1">1.1. 6.18 - 6.23</a></li>
<li><a href="#sec-1-2">1.2. 6.24 - 6.30</a></li>
<li><a href="#sec-1-3">1.3. 6.30 - 7.16</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 任务</a>
<ul>
<li><a href="#sec-2-1">2.1. 623任务</a></li>
<li><a href="#sec-2-2">2.2. 630任务</a></li>
</ul>
</li>
<li><a href="#sec-3">3. 例会</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 进度</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 6.18 - 6.23</h3>
<div class="outline-text-3" id="text-1-1">
<p>
1.调查dalvik虚拟机的用法，以及命令参数(李晋飞)
</p>

<p>
2.libdex,dumpdex在windows以及ubuntu系统上的移植(阎文斌)
</p>

<p>
3.找到所有dalvik源代码所需的头文件以及源文件并且综合到一起(阎文斌)
</p>

<p>
4.将dalvik的源代码粗略的过一遍，并形成源文件解释文档(阎文斌，王一飞，彭州，王艳东)
</p>

<p>
5.做一个简单的loader程序,此loader是正常的dex文件,加载一个名为chaosvm.so的动态库并打包成apk。打印是否成功。(李晋飞)
</p>

<p>
6.X1的设计（王一飞) &lt;- 23号对此插件进行了探讨
</p>
</div>
</div>
<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 6.24 - 6.30</h3>
<div class="outline-text-3" id="text-1-2">
<p>
1.对X1重新设计的讨论(王一飞)
</p>

<p>
2.每个人对于623代码分析任务的完成时间进行评估(全体项目组)
</p>
</div>
</div>
<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 6.30 - 7.16</h3>
<div class="outline-text-3" id="text-1-3">
<p>
1.除阎文斌与彭州外其余人完成对所分析的代码模块
</p>

<p>
2.针对hprof进行深入的调查研究(王艳东)
</p>
</div>
</div>
</div>
<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 任务</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 623任务</h3>
<div class="outline-text-3" id="text-2-1">
<p>
alloc目录 - 内存管理 356K (王艳东)
</p>

<p>
analysis - dex文件解析 504K (王一飞 李靖飞)
</p>

<p>
arch - 针对平台进行兼容的代码 80K (阎文斌)
</p>

<p>
compiler - 编译技术实现 3.9M (阎文斌 王艳东)
</p>

<p>
hprof - 内存分析模块 60K (王艳东)
</p>

<p>
interp - c语言版本的字节码解释器 224K (彭州)
</p>

<p>
minterp - 通过c语言版本的解释器生成对应平台的汇编解释器 12M (彭州)
</p>

<p>
jdwp - jdwp调试协议 232K 王一飞 (李靖飞)
</p>

<p>
native - JNI方面的原生JAVA接口 304K (王一飞 李靖飞)
</p>

<p>
oo - 面对对象的处理 340K 王一飞 (李靖飞)
</p>

<p>
os - 针对系统的线程方面的封装 20K (王艳东)
</p>

<p>
reflect - java反射实现 164K (王一飞 李靖飞)
</p>
</div>
</div>
<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 630任务</h3>
<div class="outline-text-3" id="text-2-2">
<p>
analysis - dex文件解析 504K (王一飞）
</p>

<p>
oo - 面对对象的处理 340K (李靖飞)
</p>

<p>
reflect - java反射实现 164K (李靖飞)
</p>

<p>
native - JNIT方面的原声JAVA接口 304K (王一飞 李靖飞)
</p>

<p>
对hprof的实际使用，以及当前android提供的应用做了解(王艳东)
</p>
</div>
</div>
</div>
<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 例会</h2>
<div class="outline-text-2" id="text-3">
<p>
6.23(13:30 - 16.15) 623代码分析任务的第一次分工,以及文档的规格。下周确定623任务完成时间。
</p>

<p>
6.30(13:40 - ) 首先对飞哥进行了批评，提交文档格式不正确。飞哥对X1的设计延后。
针对623任务的时间进行了规划，确定了代码分析的时间，重新划分了王一飞与李靖飞的工作。
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" >


<colgroup>
<col class="left"/>

<col class="left"/>
</colgroup>
<tbody>
<tr>
<td class="left">姓名</td>
<td class="left">时间进度</td>
</tr>

<tr>
<td class="left">王一飞</td>
<td class="left">2周</td>
</tr>

<tr>
<td class="left">李靖飞</td>
<td class="left">2周</td>
</tr>

<tr>
<td class="left">彭州</td>
<td class="left">1月</td>
</tr>

<tr>
<td class="left">王艳东</td>
<td class="left">2周</td>
</tr>

<tr>
<td class="left">阎文斌</td>
<td class="left">1月</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 13/6/2013</p>
<p class="author">Author: 四维创智</p>
<p class="date">Created: 2013-06-30 日 23:53</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 23.4.1 (<a href="http://orgmode.org">Org</a> mode 8.0-pre)</p>
<p class="xhtml-validation"><a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a></p>
</div>
</body>
</html>
